Семена/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>ПроизведенныйПродукт</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользуемыеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Неучитываемый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Семена/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Семена/src/Documents/Производство/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = ИспользуемыеМатериалы.Выгрузить();
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ Использовано
		|ИЗ
		|	&ТабИспользовано КАК Т
		|ГДЕ
		|	НЕ Т.Неучитываемый
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Использовано.Номенклатура КАК Номенклатура,
		|	Использовано.Количество КАК Количество,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА Использовано.Количество > СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ТОГДА -1000
		|		КОГДА Использовано.Количество = СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьОстаток
		|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток * Использовано.Количество
		|	КОНЕЦ КАК Стоимость
		|ИЗ
		|	Использовано КАК Использовано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&Дата, ) КАК СебестоимостьТоваровОстатки
		|		ПО Использовано.Номенклатура = СебестоимостьТоваровОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ТабИспользовано",ТЗ);
	Запрос.УстановитьПараметр("Дата",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.СебестоимостьТоваров.Записывать = Истина;
	ОбщаяСтоимость = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Стоимость = -1000 тогда
			Отказ = Истина;
			Сообщить("Не хватает позиции "+ ВыборкаДетальныеЗаписи.Номенклатура);
			Возврат;
		Иначе
			Движение = Движения.СебестоимостьТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
			ОбщаяСтоимость = ОбщаяСтоимость + Движение.Стоимость;
		КонецЕсли;
	КонецЦикла;
	
	Движение = Движения.СебестоимостьТоваров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = ПроизведенныйПродукт;
	Движение.Количество = Количество;
	Движение.Стоимость = ОбщаяСтоимость;
	
КонецПроцедуры
